# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-YUNet-seg instance segmentation model based on YUNet architecture with CARAFE upsampling
# Features: Encoder-Decoder structure with skip connections, SPPF and C2PSA in neck, CARAFE upsampling
# CARAFE: Content-Aware ReAssembly of FEatures (https://arxiv.org/abs/1905.02188)
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Encoder (Backbone with downsampling path)
backbone:
  # [from, repeats, module, args]
  # Input processing
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 - First conv layer
  
  # Encoder path - downsampling with feature extraction
  - [-1, 1, RFAConv, [128, 3, 2]] # 1-P2/4 - RFAConv for enhanced feature extraction
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 - C3k2 block
  
  - [-1, 1, RFAConv, [256, 3, 2]] # 3-P3/8 - RFAConv for better spatial attention
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 - C3k2 block
  
  - [-1, 1, RFAConv, [512, 3, 2]] # 5-P4/16 - RFAConv for receptive field attention
  - [-1, 2, C3k2, [512, True]] # 6 - C3k2 block
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 - Keep regular conv for final downsampling
  - [-1, 2, C3k2, [1024, True]] # 8 - C3k2 block
  
  # Neck - SPPF and C2PSA modules as shown in YUNet diagram
  - [-1, 1, SPPF, [1024, 5]] # 9 - SPPF module for multi-scale features
  - [-1, 2, C2PSA, [1024]] # 10 - C2PSA attention module
  - [-1, 1, RFCBAMConv, [1024, 3, 1]] # 11 - RFCBAMConv for enhanced spatial-channel attention

# Decoder head with skip connections (following YUNet architecture)
head:
  # Decoder path - first level upsampling with skip connection
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12 - CARAFE upsample from neck (auto-detects channels)
  - [[-1, 6], 1, Concat, [1]] # 13 - Skip connection from encoder P4 (layer 6)
  - [-1, 2, C3k2, [512, False]] # 14 - Process concatenated features
  - [-1, 1, RFAConv, [512, 3, 1]] # 15 - RFAConv for feature refinement
  
  # Second level upsampling with skip connection  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16 - CARAFE upsample (auto-detects channels)
  - [[-1, 4], 1, Concat, [1]] # 17 - Skip connection from encoder P3 (layer 4)
  - [-1, 2, C3k2, [256, False]] # 18 - Process concatenated features
  - [-1, 1, RFAConv, [256, 3, 1]] # 19 - RFAConv for spatial attention (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20 - CARAFE upsample (auto-detects channels)
  - [[-1, 2], 1, Concat, [1]] # 21 - Skip connection from encoder P2 (layer 2)
  - [-1, 2, C3k2, [128, False]] # 22 - Process concatenated features
  - [-1, 1, RFAConv, [128, 3, 1]] # 23 - RFAConv for spatial attention (P2/4-small)

  - [-1, 1, Conv, [128, 3, 2]] # 24 - Downsample to P2
  - [[-1, 19], 1, Concat, [1]] # 25 - Concat with P2 features  
  - [-1, 2, C3k2, [128, False]] # 26 - Process P2 features

  # Downstream path for multi-scale detection (only two levels)
  - [-1, 1, Conv, [512, 3, 2]] # 27 - Downsample to P4
  - [[-1, 15], 1, Concat, [1]] # 28 - Concat with P4 features  
  - [-1, 2, C3k2, [512, False]] # 29 - Process P4 features
  
  - [-1, 1, Conv, [1024, 3, 2]] # 30 - Downsample to P5
  - [[-1, 11], 1, Concat, [1]] # 31 - Concat with neck features
  - [-1, 2, C3k2, [1024, True]] # 32 - Process P5 features (P5/32-large)

  # Final segmentation head with three-scale outputs
  - [[23, 26, 29, 32], 1, Segment, [nc, 32, 256]] # Segment(P2, P3, P4, P5) 