# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, SPDConv, [128, 3, 1]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, SPDConv, [256, 3, 1]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, SPDConv, [512, 3, 1]]
  - [-1, 4, A2C2f, [512, True, 4]] # 5-P4/16
  - [-1, 1, SPDConv, [1024, 3, 1]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [2, 1, Conv, [256]]  # 11 - P2 feature processing
  - [4, 1, Conv, [256]]  # 12 - P3 feature processing
  - [6, 1, Conv, [256]]  # 13 - P4 feature processing
  - [10, 1, Conv, [256]] # 14 - P5 feature processing

  # Top-down path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15 - upsample P5
  - [[-1, 13], 1, BiFPN_Concat2, [1]] # 16 - cat P5 upsampled + P4
  - [-1, 2, A2C2f, [256, False, -1]] # 11 # 17 - process fused P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18 - upsample P4
  - [[-1, 12], 1, BiFPN_Concat2, [1]] # 19 - cat P4 upsampled + P3
  - [-1, 2, A2C2f, [256, False, -1]] # 11 # 20 - process fused P3 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21 - upsample P4
  - [[-1, 11], 1, BiFPN_Concat2, [1]] # 22 - cat P4 upsampled + P3
  - [-1, 2, A2C2f, [256, False, -1]] # 11 # 23 - process fused P3 (P3/8-small)

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]] # 24 - downsample P3
  - [[-1, 12, 20], 1, BiFPN_Concat3, [1]] # 25 - cat P3 downsampled + P4
  - [-1, 2, A2C2f, [256, False, -1]] # 11 # 26 - process fused P4 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]] # 27 - downsample P3
  - [[-1, 13, 17], 1, BiFPN_Concat3, [1]] # 28 - cat P3 downsampled + P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11 # 29 - process fused P4 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 30 - downsample P4
  - [[-1, 14], 1, BiFPN_Concat2, [1]] # 31 - cat P4 downsampled + P5
  - [-1, 3, C3k2, [1024, True]] # 32 - process fused P5 (P5/32-large)

  - [[23, 26, 29, 32], 1, Detect, [nc]] # 33 - Detect(P3, P4, P5)
