# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, SPDConv, [128, 3]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, SPDConv, [256, 3]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, SPDConv, [512, 3]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SPDConv, [1024, 3]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, CBAM, []]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10



head:
  # ---------------- PRE-PROCESSING ----------------
  # Force all backbone levels to Base 256 (Actual 64ch at scale 'n')
  - [4, 1, Conv, [256, 1, 1]]  # 11 - P3_in (64 ch)
  - [6, 1, Conv, [256, 1, 1]]  # 12 - P4_in (64 ch)
  - [10, 1, Conv, [256, 1, 1]] # 13 - P5_in (64 ch)

  # ---------------- TOP-DOWN PATH ----------------
  # Fuse P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 (P5_up)
  - [[-1, 13], 1, BiFPN_Add2, [256]] # 15 (Fuse P5_up + P4_in)
  - [-1, 2, C3k2, [256, True]] # 16 (Process Features)

  # Fuse P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 (P4_up)
  - [[-1, 12], 1, BiFPN_Add2, [256]] # 18 (Fuse P4_up + P3_in)
  - [-1, 2, C3k2, [256, True]] # 19 (Process P3)

  # ---------------- BOTTOM-UP PATH ----------------
  # Fuse P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]] # 20 (Downsample P3 to 64ch)
  
  # Fuse: [P3_down (22)] + [P4_in (12)] + [P4_Top_Down (17)]
  # Note: Index 17 is the CBAM layer from the top-down path
  - [[-1, 13, 17], 1, BiFPN_Add3, [256]] # 21
  
  - [-1, 2, C3k2, [512, True]] # 22 (Expand to 128ch for Detect)

  # Fuse P4 -> P5
  - [-1, 1, Conv, [256, 3, 2]] # 23 (Project P4 back to 64ch for fusion)
  
  # Fuse: [P4_down (26)] + [P5_in (13)]
  - [[-1, 14], 1, BiFPN_Add2, [256]] # 24
  
  - [-1, 2, C3k2, [1024, True, 0.5, True]] # 25 (Expand to 256ch for Detect)

  # ---------------- DETECT ----------------
  # Inputs are the CBAM layers: 21 (P3), 25 (P4), 29 (P5)
  - [[20, 23, 26], 1, Detect, [nc]]


